In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\77761\anaconda3\lib\site-packages (1.3.4)
Requirement already satisfied: numpy>=1.17.3 in c:\users\77761\anaconda3\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\77761\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in c:\users\77761\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\77761\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [33]:
import pandas as pd

data = {
    'phone_name': ['Xiaomi Redmi Note 10', 'Iphone 13', 'Nexus 7', 'Nokia'],
    'price': [150000, 400000, 200000, None],
    'country': ['China', 'USA', None, 'Finland']
}

df = pd.DataFrame(data)
print(df)

             phone_name     price  country
0  Xiaomi Redmi Note 10  150000.0    China
1             Iphone 13  400000.0      USA
2               Nexus 7  200000.0     None
3                 Nokia       NaN  Finland

In [11]:
# info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   phone_name  4 non-null      object
 1   price       3 non-null      float64
 2   country     3 non-null      object
dtypes: float64(1), object(2)
memory usage: 228.0+ bytes

In [12]:
# describe()
df.describe()

               price
count       3.000000
mean   250000.000000
std    132287.565553
min    150000.000000
25%    175000.000000
50%    200000.000000
75%    300000.000000
max    400000.000000

In [14]:
print(df)

             phone_name     price  country
0  Xiaomi Redmi Note 10  150000.0    China
1             Iphone 13  400000.0      USA
2               Nexus 7  200000.0     None
3                 Nokia       NaN  Finland

In [16]:
display(df)

             phone_name     price  country
0  Xiaomi Redmi Note 10  150000.0    China
1             Iphone 13  400000.0      USA
2               Nexus 7  200000.0     None
3                 Nokia       NaN  Finland

In [18]:
df.index = ['a','b','c','d']
display(df)

             phone_name     price  country
a  Xiaomi Redmi Note 10  150000.0    China
b             Iphone 13  400000.0      USA
c               Nexus 7  200000.0     None
d                 Nokia       NaN  Finland

In [21]:
df.columns = ['название', 'цена', 'страна']
display(df)

               название      цена   страна
a  Xiaomi Redmi Note 10  150000.0    China
b             Iphone 13  400000.0      USA
c               Nexus 7  200000.0     None
d                 Nokia       NaN  Finland

In [26]:
# loc
df.loc[4] = ['Samsung Galaxy Flip 3', 470000, 'Корея']

display(df)

                название      цена   страна
a   Xiaomi Redmi Note 10  150000.0    China
b              Iphone 13  400000.0      USA
c                Nexus 7  200000.0     None
d                  Nokia       NaN  Finland
e  Samsung Galaxy Flip 3  470000.0    Корея
4  Samsung Galaxy Flip 3  470000.0    Корея

In [29]:
# drop
df.drop(4, inplace=True)

In [30]:
df

                название      цена   страна
a   Xiaomi Redmi Note 10  150000.0    China
b              Iphone 13  400000.0      USA
c                Nexus 7  200000.0     None
d                  Nokia       NaN  Finland
e  Samsung Galaxy Flip 3  470000.0    Корея

In [30]:
import numpy as np
data = {
    'name': ['Apple', 'Orange', 'Banana'],
    'color': ['Red', 'Ornage', 'Yellow'],
    'quantity_in_pack': [3, 8, 5],
    'price':[1000, 800, 900]
}
df = pd.DataFrame(data)
df.index = np.arange(3, len(df) + 3)
print("Mean:")
display(df.describe().mean())
print("Median:")
display(df.describe().median())

df.drop(3, inplace=True)
display(df)

Mean:

quantity_in_pack      4.668743
price               687.875000
dtype: float64

Median:

quantity_in_pack      4.5
price               875.0
dtype: float64

     name   color  quantity_in_pack  price
4  Orange  Ornage                 8    800
5  Banana  Yellow                 5    900

In [31]:
df.index = ['a','b']
df.columns= df.columns.str.replace("name", "Name")
df.columns= df.columns.str.replace("color", "Color")
df.columns= df.columns.str.replace("price", "Price")
display(df)
# df.loc[4] = ['Samsung Galaxy Flip 3', 470000, 'Корея']
df.loc[3]=['Киви', 'зеленый', 5,500]
display(df)

     Name   Color  quantity_in_pack  Price
a  Orange  Ornage                 8    800
b  Banana  Yellow                 5    900

     Name    Color  quantity_in_pack  Price
a  Orange   Ornage                 8    800
b  Banana   Yellow                 5    900
3    Киви  зеленый                 5    500

In [35]:
#Дз
data={
    'Товар': ['Хлеб', 'Молоко', 'Сыр', 'Яйца', 'Масло'],
    'Продано': [100, 200, 50, 300, 75],
    'Цена за еденицу ($)' : [0.5,1,5,0.2,0.2]
    
}

In [48]:
df = pd.DataFrame(data)
df.loc[4]=['Киви', 69, 3]

print(df.describe().max()[0])
print(df.describe().mean())

300.0
Продано                121.565550
Цена за еденицу ($)      2.333661
dtype: float64